[
  {
    "id": 1,
    "title": "The Girl from the Sea",
    "authors": ["Molly Knox Ostertag"],
    "categories": ["Gaphic Novel", "Romance", "Teenage"],
    "year": "2021",
    "language": "en",
    "description": "Fifteen-year-old Morgan has a secret: She can't wait to escape the perfect little island where she lives. She's desperate to finish high school and escape her sad divorced mom, her volatile little brother, and worst of all, her great group of friends...who don't understand Morgan at all. Because really, Morgan's biggest secret is that she has a lot of secrets, including the one about wanting to kiss another girl.Then one night, Morgan is saved from drowning by a mysterious girl named Keltie. The two become friends and suddenly life on the island doesn't seem so stifling anymore.But Keltie has some secrets of her own. And as the girls start to fall in love, everything they're each trying to hide will find its way to the surface...whether Morgan is ready or not.",
    "price": 15.2,
    "currency": "USD",
    "cover": "https://m.media-amazon.com/images/I/81oaAbZMCPL._AC_UF894,1000_QL80_.jpg"
  },
  {
    "id": 2,
    "title": "Heartstopper Volume 1",
    "authors": ["Alice Oseman"],
    "categories": ["Gaphic Novel", "Romance", "Teenage"],
    "year": "2022",
    "language": "en",
    "description": "*Now a live-action Netflix series!* Boy meets boy. Boys become friends. Boys fall in love. Heartstopper is the bestselling LGBTQ+ graphic novel: this new edition - with a cover including Alice Oseman's artwork and photographs showing characters from the Netflix show - also contains exclusive pages from Alice's original TV scripts.",
    "price": 10.0,
    "currency": "USD",
    "cover": "https://m.media-amazon.com/images/I/91tGycEuoOL._SY466_.jpg",
    "promoted": true
  },
  {
    "id": 3,
    "title": "One Last Stop",
    "authors": ["Casey McQuiston"],
    "categories": ["Young adult", "Romance"],
    "year": "2022",
    "language": "en",
    "description": "For cynical twenty-three-year-old August, moving to New York City is supposed to prove her right: that things like magic and cinematic love stories don’t exist, and the only smart way to go through life is alone. She can’t imagine how waiting tables at a 24-hour pancake diner and moving in with too many weird roommates could possibly change that. And there’s certainly no chance of her subway commute being anything more than a daily trudge through boredom and electrical failures. But then, there’s this gorgeous girl on the train. Jane. Dazzling, charming, mysterious, impossible Jane. Jane with her rough edges and swoopy hair and soft smile, showing up in a leather jacket to save August’s day when she needed it most. August’s subway crush becomes the best part of her day, but pretty soon, she discovers there’s one big problem: Jane doesn’t just look like an old school punk rocker. She’s literally displaced in time from the 1970s, and August is going to have to use everything she tried to leave in her own past to help her. Maybe it’s time to start believing in some things, after all. Casey McQuiston’s One Last Stop is a magical, sexy, big-hearted romance where the impossible becomes possible as August does everything in her power to save the girl lost in time.",
    "price": 18.5,
    "currency": "USD",
    "cover": "https://m.media-amazon.com/images/I/71lgJOq+mHL._SY466_.jpg",
    "promoted": true
  },
  {
    "id": 4,
    "title": "Red, White & Royal Blue",
    "authors": ["Casey McQuiston"],
    "categories": ["Young adult", "Romance"],
    "year": "2022",
    "language": "en",
    "description": "Alex Claremont-Diaz is handsome, charismatic, a genius – pure millennial-marketing gold for the White House ever since his mother first became President of the United States. There’s only one problem. When the tabloids get hold of a photo involving an altercation between Alex and Prince Henry, U.S./British relations take a turn for the worse. Heads of family and state devise a plan for damage control: stage a truce. But what begins as a fake, Instagrammable friendship grows deeper, and more dangerous, than either Alex or Henry could have imagined. Soon they are hurtling into a secret romance that could derail the presidential campaign and upend two nations.",
    "price": 11.5,
    "currency": "USD",
    "cover": "https://m.media-amazon.com/images/I/71Fq7XMmjEL._SY466_.jpg"
  },
  {
    "id": 5,
    "title": "Aristotle and Dante Discover the Secrets of the Universe",
    "authors": ["Benjamin Alire Saenz"],
    "categories": ["Young adult", "Romance"],
    "year": "2014",
    "language": "en",
    "description": "Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this friendship that Ari and Dante will learn the most important truths about themselves and the kind of people they want to be.",
    "price": 20.2,
    "currency": "USD",
    "cover": "https://m.media-amazon.com/images/I/81w9ZlovACL._SY466_.jpg"
  },
  {
    "id": 6,
    "title": "The Ballad of Songbirds and Snakes",
    "authors": ["Suzanne Collins"],
    "categories": ["Action", "Young adult"],
    "year": "2021",
    "language": "en",
    "description": "The Ballad of Songbirds and Snakes will revisit the world of Panem sixty-four years before the events of The Hunger Games, starting on the morning of the reaping of the Tenth Hunger Games.",
    "price": 12.8,
    "currency": "USD",
    "cover": "https://m.media-amazon.com/images/I/716ia2mYOvS._SY466_.jpg"
  },
  {
    "id": 7,
    "title": "Radio Silence",
    "authors": ["Alice Oseman"],
    "categories": ["Fiction", "Teenage"],
    "year": "2023",
    "language": "en",
    "description": "What if everything you set yourself up to be was wrong? Frances has always been a study machine with one goal: elite university. Nothing will stand in her way. Not friends, not a guilty secret--not even the person she is on the inside. But when Frances meets Aled, the shy genius behind her favorite podcast, she discovers a new freedom. He unlocks the door to Real Frances and for the first time she experiences true friendship, unafraid to be herself. Then the podcast goes viral and the fragile trust between them is broken. Caught between who she was and who she longs to be, Frances's dreams come crashing down. Suffocating with guilt, she knows that she has to confront her past... She has to confess why Carys disappeared... Meanwhile at university, Aled is alone, fighting even darker secrets. It's only by facing up to your fears that you can overcome them. And it's only by being your true self that you can find happiness. Frances is going to need every bit of courage she has.",
    "price": 23.0,
    "currency": "USD",
    "cover": "https://m.media-amazon.com/images/I/71FMu3LYkPL._SY466_.jpg"
  },
  {
    "id": 8,
    "title": "Solitaire",
    "authors": ["Alice Oseman"],
    "categories": ["Teenage"],
    "year": "2014",
    "language": "en",
    "description": "In case you're wondering, this is not a love story. \"The Catcher in the Rye for the digital age\" The Times",
    "price": 29.9,
    "currency": "USD",
    "cover": "https://m.media-amazon.com/images/I/61a8tTIWA1L._SY466_.jpg"
  },
  {
    "id": 9,
    "title": "They Both Die at the End",
    "authors": ["Adam Silvera"],
    "categories": ["Fiction", "Young adult"],
    "year": "2018",
    "language": "en",
    "description": "On September 5, a little after midnight, Death-Cast calls Mateo Torrez and Rufus Emeterio to give them some bad news: They're going to die today. Mateo and Rufus are total strangers, but, for different reasons, they're both looking to make a new friend on their End Day. The good news: There's an app for that. It's called the Last Friend, and through it, Rufus and Mateo are about to meet up for one last great adventure--to live a lifetime in a single day. In the tradition of Before I Fall and If I Stay, They Both Die at the End is a tour de force from acclaimed author Adam Silvera, whose debut, More Happy Than Not, the New York Times called \"profound.\" Featuring a map of the novel's characters and their connections, an exclusive essay by the author, and a behind-the-scenes look at the early outlines for this critically acclaimed bestseller.",
    "price": 13.3,
    "currency": "USD",
    "cover": "https://m.media-amazon.com/images/I/81o8BYrG4BL._SY466_.jpg",
    "promoted": true
  },
  {
    "id": 10,
    "title": "Loveless",
    "authors": ["Alice Oseman"],
    "categories": ["Romance", "Young adult"],
    "year": "2020",
    "language": "en",
    "description": "Georgia has never been in love, never kissed anyone, never even had a crush - but as a fanfic-obsessed romantic she's sure she'll find her person one day. As she starts university with her best friends, Pip and Jason, in a whole new town far from home, Georgia’s ready to find romance, and with her outgoing roommate on her side and a place in the Shakespeare Society, her 'teenage dream' is in sight.",
    "price": 21.8,
    "currency": "USD",
    "cover": "https://m.media-amazon.com/images/I/71abDtDqdGS._SY466_.jpg",
    "promoted": true
  }
]
